Openfoam/Twophase_interfoam/cases/channel395/0.orig/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    topWall
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    sides1_half0
    {
        type            empty;
    }
    sides2_half0
    {
        type            empty;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            empty;
    }
    sides1_half1
    {
        type            empty;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}
