Openfoam/Twophase_interfoam/cases/channel395/0.orig/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    sides1_half0
    {
        type            empty;
    }
    sides2_half0
    {
        type            empty;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            empty;
    }
    sides1_half1
    {
        type            empty;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}
