Openfoam/Twophase_interfoam/cases/channel395/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}

numberOfSubdomains  8;

method          simple;

simpleCoeffs
{
    n           (4 2 1);
}
