Openfoam/Twophase_interfoam/cases/channel395/system/fvConstraints
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}

momentumForce
{
    type            meanVelocityForce;

    selectionMode   all;

    Ubar            (0.1335 0 0);
}
